app/controllers/produtos_controller.rb

  def index
    @produtos = Produto.all
---
SELECT `produtos`.* FROM `produtos`

  def create
    @produto = Produto.new(produto_params)

    respond_to do |format|
      if @produto.save
---
INSERT INTO `produtos` (`nome`, `descricao`, `preco`, `quantidade`, `created_at`, `updated_at`) VALUES ('teste', 'teste', 1, 2, '2024-10-07 20:13:58.633875', '2024-10-07 20:13:58.633875')

  def destroy
    @produto.destroy!
---
DELETE FROM `produtos` WHERE `produtos`.`id` = 1

    def set_produto
      @produto = Produto.find(params[:id])
---
SELECT `produtos`.* FROM `produtos` WHERE `produtos`.`id` = 1 LIMIT 1